[
    {   "id": "wz-shrapnel-shells",
        "name": "Shrapnel Shells",
        "sp": 2,
        "source": "WAZAL",
        "license": "KS-2 PINK DISK",
        "license_level": 2,
        "effect": "When you attack with the weapon this mod is attached to, you may have it fire a Shrapnel Shell instead of attacking normally. When determining where the attack hits, it loses the Line or Blast tags, and gains Cone 5 in addition to its normal Range. Determine a point of impact in Range as normal, then resolve Cone 5 from that space, with the cone always pointing away from your Mech. This attack does half damage to Mechs but double damage to Cover and actors with the Biological tag.",
        "description": "<i>Airbursting shrapnel rounds rain solid metal down on the battlefield- weapons of little use against Mechs, but absolutely devastating in their impact.</i>",
        "tags": [{"id": "tg_unique"}],
        "allowed_types": ["Cannon","Launcher"]
    },
    {   "id": "wz-dual-charge-warheads",
        "name": "Dual-Charge Warheads",
        "source": "WAZAL",
        "license": "KS-7 ORANGE WORM",
        "license_level": 1,
        "sp": 1,
        "effect": "Choose one Launcher or Cannon: This weapon deals +2 bonus Explosive damage to targets with 2 Armour or less. It also gains the following property:<br><br><b>On Critical Hit</b>: Every actor adjacent to the target must pass a Hull save or take 1 Explosive damage.",
        "description": "<i>“Yeah, a plasma charge or nanofilament bundle might hit harder or more reliably, sure. There’s still something to be said for two explosively-formed penetrators stacked on top of each other.”</i>",
        "tags": [{"id": "tg_unique"}],
        "allowed_types": ["Cannon","Launcher"]
    },
    {   "id": "wz-wire-guide-systems",
        "name": "Wire-Guide Systems",
        "source": "WAZAL",
        "license": "KS-7 ORANGE WORM",
        "license_level": 1,
        "sp": 1,
        "effect": "Choose one Launcher or Cannon: It gains Ordnance. When you make an attack with this weapon, before rolling to hit, you may declare that you are using a wire-guide system to control it. The attack gains Accurate and Seeking. If you miss with an attack with this weapon, you may take 1 Heat to immediately roll a second attack against a different target within range, provided that it is further away from you than the original target. This second attack cannot inflict Critical Damage.",
        "description": "<i>Though this practically medieval manual targeting system is tricky to use and severely restricts the movement of its firing platform, it has the added advantage of being almost wholly un-jammable.</i>",
        "tags": [{"id": "tg_unique"}],
        "allowed_types": ["Cannon","Launcher"],
        "added_tags": [{"id": "tg_ordnance"}]
    },
    {   "id": "wz-top-attack-targeting",
        "name": "Top-Attack Targeting",
        "source": "WAZAL",
        "license": "KS-7 ORANGE WORM",
        "license_level": 3,
        "sp": 2,
        "effect": "Choose one Launcher or Cannon: It gains Smart and Arcing. When you make an attack with this weapon, you may select up to 3 targets within its area of effect (if it has one): each target must pass a Hull save or fall Prone, even if the attack did no damage to them. For each target selected in this way, you gain 1 Heat.",
        "description": "<i>Tactical necessity dictates that most mechs will be most heavily armoured on their front and sides, sacrificing top and rear armour in the process. The inclusion of a simple gyroscopic guidance system, even in a “dumb” weapon, can greatly increase the possibility of damaging this more vulnerable armour.</i>",
        "tags": [{"id": "tg_unique"}],
        "allowed_types": ["Cannon","Launcher"],
        "added_tags": [{"id": "tg_smart"},{"id": "tg_arcing"}]
    },
    {   "id": "wz-ramjet-rounds",
        "name": "Ramjet Rounds",
        "sp": 2,
        "source": "WAZAL",
        "license": "KS-7 ORANGE WORM",
        "license_level": 3,   
        "effect": "Choose one Launcher or Cannon: it gains Loading and Heat 1 (Self). In addition to its usual damage, it deals bonus Kinetic Damage based on its size; Auxiliary (+1), Main (+2), or Heavy/Superheavy (+3).  When this weapon damages a target, draw an area of Line 3 extending from its space- this line can be in any direction so long as it is not pointed towards your Mech. Targets within that Line must pass a Hull save or take 1 AP Kinetic damage and 1 Burn.",
        "description": "<i>“Oh, yeah, just about everyone uses ramjet-assists on their artillery and such. Common as dirt- but what most realize is that you can scale that kind of tech down to fit almost any projectile, if you’re clever enough.”</i>",
        "tags": [{"id": "tg_unique"}],
        "allowed_types": ["Cannon","Launcher"], 
        "added_tags": [{"id": "tg_loading"},{"id": "tg_heatself", "val": "1"}]
    },
    {   "id": "wz-hesh",
        "name": "HESH Rounds",
        "source": "WAZAL",
        "license": "TR-10 INDIGO DREAM",
        "license_level": 3,
        "sp": 1,
        "effect": "Choose one ranged weapon that does Kinetic damage. It gains the following:<br><b>On Hit</b>: This weapon deals bonus Energy damage equal to the target’s armour.",
        "description": "<i>“LEAD-CORE EXPLOSIVE SQUASH HEAD! NO WEAKNESSES!”</i>",
        "tags": [{"id": "tg_unique"}],
        "restricted_types": ["Melee"]
     
    },
    {   "id": "wz-sawnoff",
        "name": "Sawn-Off",
        "source": "WAZAL",
        "license": "TR-11 JADE CLIPPER",
        "license_level": 1,
        "sp": 1,
        "effect": "Choose one Main or Auxiliary Rifle, Launcher or Cannon: it gains Threat 2, Overkill, and halves its range.",
        "description": "<i>Removing most of the barrel elements of a weapon seldom increases its firepower, but it sure as hell looks cool.</i>",
        "tags": [{"id": "tg_unique"}],
        "allowed_types": ["Cannon","Launcher", "Rifle"],
        "allowed_sizes": ["Main","Auxiliary"],
        "added_tags": [{"id": "tg_overkill"}]
    }
]
